---
title: "To find null in a DataFrame"
author: "Yagan Arun"
date: 2020-08-11
description: "-"
type: technical_note
draft: false
---

In [14]:
cars = [['Audi' , 10] , ['Apple' , None] , ['Lambhorghini',10] , ['Bens',9] , ['Samsung',None]]

In [15]:
import pandas as pd
custom = pd.DataFrame(data=cars , columns=['Car','Rating'])

In [16]:
custom

            Car  Rating
0          Audi    10.0
1         Apple     NaN
2  Lambhorghini    10.0
3          Bens     9.0
4       Samsung     NaN

In [17]:
custom.isnull() #easy with small datasets

     Car  Rating
0  False   False
1  False    True
2  False   False
3  False   False
4  False    True

In [19]:
custom.isnull().sum() #gives the count of null for each colums in data set

Car       0
Rating    2
dtype: int64

In [20]:
custom.isnull().sum().max() # gives the max number of null values

2